Revit 2027 API
FabricationAncillaryUsage.AncillaryId Property
 Fabrication ancillary database identifier.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public int AncillaryId { get; }
Public ReadOnly Property AncillaryId As Integer
	Get
public:
property int AncillaryId {
	int get ();
}
member AncillaryId : int with get
Property Value
Int32
See Also
Reference
FabricationAncillaryUsage Class
Autodesk.Revit.DB Namespace